// ------------------------------------------------------------------------
// Main Window
// ------------------------------------------------------------------------
"Speed Dial/Group Dial List"="Speed Dial/Group Dial List";
"Str_Fax_Printer_Speed_Dial_Speed_Dial_Count"="Speed Dial: %d";
"Str_Fax_Printer_Speed_Dial_Group_Dial_Count"="Group: %d";
"Str_Fax_Printer_Speed_Dial_Speed_Dial_Max"="Maximum number of entries: %d";
"Str_Fax_Printer_Speed_Dial_Group_Dial_Max"="You can add up to %d speed dial entries.";
"Import from Other Phone Book"="Import from Address Book";

// ------------------------------------------------------------------------
// OK/Cancel
// ------------------------------------------------------------------------
"OK"="OK";
"Cancel"="Cancel";

// ------------------------------------------------------------------------
// Confirm write Speed Dial/Group Dial for Printer
// ------------------------------------------------------------------------
"Str_Alert_Printer_Speed_Dial_Confirm_Write"="The Speed Dial/Group Dial for printer \"%@\" has been changed.\nDo you want to save these changes in the printer?";
"Str_Alert_Printer_Speed_Dial_Confirm_Before_Execute"="The Speed Dial/Group Dial for printer \"%@\" has been changed.";

// ------------------------------------------------------------------------
// Wait Dialog(read Speed Dial/Group Dial)
// ------------------------------------------------------------------------
"Str_Alert_Printer_Speed_Dial_Read_Wait_Dial"="Getting Speed Dials.";

// ------------------------------------------------------------------------
// Confirm write data
// ------------------------------------------------------------------------
"Str_Alert_Printer_Speed_Dial_Confirm_Write_Data"="Ready to start saving data. Do you want to continue?";

// ------------------------------------------------------------------------
// Confirm over write data
// ------------------------------------------------------------------------
"Str_Alert_Printer_Speed_Dial_Confirm_ReWrite"="The printer's Speed Dial/Group Dial settings are being overwritten by a third party.\nDo you want to overwrite?";

// ------------------------------------------------------------------------
// Wait Dialog(write Speed Dial/Group Dial)
// ------------------------------------------------------------------------
"Str_Alert_Printer_Speed_Dial_Send_Wait_Dial"="Sending Speed Dials.";

// ------------------------------------------------------------------------
// Confirm Import data
// ------------------------------------------------------------------------
"Str_Alert_Printer_Speed_Dial_Confirm_Import_Dial"="If personal information is imported that includes unsupported characters for Speed Dial names, the Speed Dial column is left blank.";

// ------------------------------------------------------------------------
// Select Import Target
// ------------------------------------------------------------------------
"Select Import Target"="Select Import Target";
"Select data to import."="Select data to import.";

// ------------------------------------------------------------------------
// Edit Speed Dial
// ------------------------------------------------------------------------
"Str_Edit_Speed_Dial_Dlg_Window_Title"="Edit Speed Dial";
"Str_Edit_Speed_Dial_Entry_Number"="Entry Number : %d";
"Name/Group Name"="Name/Group Name";
"Fax Number"="Fax Number";
"Because \"-\" acts as a pause, do not use it to punctuate phone numbers."="Because \"-\" acts as a pause, do not use it to punctuate phone numbers.";
"Speed Dial"="Speed Dial";
"Group Dial"="Group Dial";

// ------------------------------------------------------------------------
// Edit Group Dial
// ------------------------------------------------------------------------
"Str_Edit_Group_Dial_Dlg_Window_Title"="Edit Group Dial";
"Str_Edit_Group_Dial_Entry_Number"="Entry Number : %d";
"Member"="Member";
"Entry Number"="Entry Number";

// ------------------------------------------------------------------------
// Confirm Delete Data
// ------------------------------------------------------------------------
"Str_Alert_Printer_Speed_Dial_Confirm_Delete_Dial"="Do you want to delete entry No. %d Speed Dial?";
"Str_Alert_Printer_Speed_Dial_Confirm_Delete_Dial_Group"="Entry No. %d Speed Dial has been registered to one or more groups, and also will be deleted from the group(s).\nDo you want to erase entry No. %d Speed Dial?";
"Str_Alert_Printer_Speed_Dial_Confirm_Delete_Dial_Group_Count0"="Entry No. %d Speed Dial has been registered to one or more groups, and also will be deleted from the group(s). As a result, some of the group(s) will become empty and also will be erased.\nDo you want to erase entry No. %d Speed Dial?";
"Str_Alert_Printer_Speed_Dial_Confirm_Delete_Group"="Do you want to delete entry No. %d Group Dial?";

// ------------------------------------------------------------------------
// Confirm Delete All Data
// ------------------------------------------------------------------------
"Str_Alert_Printer_Speed_Dial_Confirm_Delete_Dial_All"="Do you want to erase all Speed Dial lists and Group Dial lists for printer \"%@\"?";

// ------------------------------------------------------------------------
// Menu
// ------------------------------------------------------------------------
"FAX Utility"="FAX Utility";
"About FAX Utility..."="About FAX Utility...";
"Preferences..."="Preferences...";
"Services"="Services";
"Hide FAX Utility"="Hide FAX Utility";
"Hide Others"="Hide Others";
"Show All"="Show All";
"Quit FAX Utility"="Quit FAX Utility";
"File"="File";
"Get Speed Dials..."="Get Speed Dials";
"Send Speed Dials..."="Send Speed Dials";
"Import"="Import";
"Back up"="Back up";
"Close"="Close";
"From Address Book"="From Address Book";
"Save Backup..."="Save Backup...";
"Restore Backup..."="Restore Backup...";
"Edit"="Edit";
"Undo"="Undo";
"Redo"="Redo";
"Cut"="Cut";
"Copy"="Copy";
"Paste"="Paste";
"Select All"="Select All";
"Edit..."="Edit...";
"Delete"="Delete";
"Delete All"="Delete All";
"Window"="Window";
"Minimize"="Minimize";
"Help"="Help";

// ------------------------------------------------------------------------
// Alert(Common)
// ------------------------------------------------------------------------
"Str_Alert_Common_Cancel"="Cancel";
"Str_Alert_Common_OK"="OK";

"Str_Alert_Common_Necessary_File_Not_Found"="Cannot find the necessary file to execute the application.\nReinstall FAX Utility.";
"Str_Alert_Common_Cannot_Get_Printer_Information"="Unable to obtain printer (fax) information. Open \"Print & Fax Preferences\" and add the PC-FAX driver.";
"Str_Alert_Common_Confirm_OverWrite"="The file specified already exists. Do you want to overwrite?";
"Str_Alert_Common_Not_Responding_Error"="The printer is not responding. Make sure the printer is connected correctly and the power is on.";
"Str_Alert_Common_Communication_Error"="A printer communication error occurred.";
"Str_Alert_Common_Printer_Processing_Error"="The printer is processing data. Wait for a while and then try again.";
"Str_Alert_Common_Communication_Error_With_ErrorCode"="An error was detected while communicating with the printer.\nError Code (%d)";
"Str_Alert_Common_Error_Occurred"="Processing canceled because an error occurred.";
"Str_Alert_Common_PrinterStatusError"="An error occurred in the printer. Clear the error and then try again.";

// ------------------------------------------------------------------------
// Alert(Printer Speed Dial/Group Dial)
// ------------------------------------------------------------------------
"Str_Alert_Fax_SpeedDial_GroupDial_Cannot_Open"="Cannot open Speed Dial/Group Dial List because another FAX Utility function is already running. Please wait until it has finished and try again.";
"Str_Alert_Fax_SpeedDial_GroupDial_Dial_Data_Write_Failed"="Failed to write Speed Dial/Group Dial.\nDo you want to exit Speed Dial/Group Dial List?";
"Str_Alert_Fax_SpeedDial_GroupDial_Cannot_Open_Fax_Phone_Book"="Cannot open the Address Book.\nError code (%d)";
"Str_Alert_Fax_SpeedDial_GroupDial_Fax_Phone_Book_Not_Found"="Cannot find the Address Book.\nImporting canceled.";
"Str_Alert_Fax_SpeedDial_GroupDial_Cannot_Get_Fax_Phone_Book_Data"="Cannot acquire data from the Address Book.";
"Str_Alert_Fax_SpeedDial_GroupDial_BackupFile_Write_Failed_Volume_Near_Full"="Failed to write the backup file.\nThere is not enough free space or it may be write protected.";
"Str_Alert_Fax_SpeedDial_GroupDial_BackupFile_Write_Failed_Other_Application_Using"="Failed to write the backup file.\nThe file specified is being used by another application.";
"Str_Alert_Fax_SpeedDial_GroupDial_BackupFile_Write_Failed_With_ErrorCode"="Failed to write the backup file.\nError Code (%d)";
"Str_Alert_Fax_SpeedDial_GroupDial_BackupFile_Read_Failed_File_Broken"="Cannot recognize the file format.\nThe file may be corrupt or created by another application.";
"Str_Alert_Fax_SpeedDial_GroupDial_BackupFile_Read_Failed_Other_Application_Using"="Failed to read the backup file.\nThe specified file is being used by another application.";
"Str_Alert_Fax_SpeedDial_GroupDial_BackupFile_Read_Failed_With_ErrorCode"="Failed to read the backup file.\nError Code (%d)";
"Str_Alert_Fax_SpeedDial_GroupDial_Input_GroupName_Not_Support"="An unsupported character has been entered in the Name/Group Name.\nYou can use only alphanumeric characters and symbols.";
"Str_Alert_Fax_SpeedDial_GroupDial_Input_FaxNumber_Not_Support"="The fax number includes unsupported character(s).\nYou can use only 0-9, *, #, -, and space.";
"Str_Alert_Fax_SpeedDial_GroupDial_Confirm_Delete_Speed_Dial"="Entry No. %d Speed Dial has been registered to one or more groups. Changing the Speed Dial to Group Dial deletes the Speed Dial from the existing group(s).\nDo you want to change entry No. %d Speed Dial to Group Dial?";
"Str_Alert_Fax_SpeedDial_GroupDial_Confirm_Delete_Speed_Dial_And_Group_Dial"="Entry No. %d Speed Dial has been registered to one or more groups. Changing the Speed Dial to Group Dial deletes the Speed Dial from the existing group(s). As a result, some of the group(s) will become empty and also will be erased.\nDo you want to change entry No. %d Speed Dial to Group Dial?";
"Str_Alert_Fax_SpeedDial_GroupDial_Maximum_Group_Dial"="You can register up to %d Speed Dial numbers to one Group.";
"Str_Alert_Fax_SpeedDial_GroupDial_Input_Name_Is_Space_Only"="You cannot enter only spaces for the Name/Group Name.";
"Str_Alert_Fax_SpeedDial_GroupDial_Input_FaxNumber_Is_Space_Only"="You cannot enter only spaces for the Fax Number.";
"Str_Alert_Fax_SpeedDial_GroupDial_Import_File_Not_Found"="Cannot find the file to import.";
"Str_Alert_Fax_SpeedDial_GroupDial_BackupFile_Read_Failed_File_Version"="The selected file can not be read because it was created with a newer version of FAX Utility.";
"Str_Alert_Fax_SpeedDial_GroupDial_BackupFile_Read_Confirm_Trim_Data"="The specified file includes some entries that can not be restored because their entry numbers exceed the limit for the connected printer shown below.\nDo you want to restore the valid entries?";
"Str_AlertInfo_Fax_SpeedDial_GroupDial_BackupFile_Read_Confirm_Trim_Data"="Maximum number of entries: %d\nMaximum number of entries per Group Dial: %d";
"Str_Alert_Fax_SpeedDial_GroupDial_BackupFile_Read_NoAvailableData"="No entries from the specified file can be restored.";

// ------------------------------------------------------------------------
"NickName"="Index Word";
"Fax Speed"="Fax Speed";
"Default Speed"="Default";
"StrAlert_Input_NickName_UnknownCharacter_Not_Support"="An unsupported character has been entered in the Index Word.";
"StrAlert_Input_Name_UnknownCharacter_Not_Support"="An unsupported character has been entered in the Name/Group Name.";
"Str_InUseByAnotherFunction"="In use by another function";

"StrAlert_InUseByAnotherFunction_CannotMove"="Cannot move. There are one or more entries that are in use by another function at or around the specified position.";
"StrAlert_ProtectedData_Exist"="There are one or more entries that are in use for scheduled fax or other functions. They are being protected and cannot be changed.";
"StrAlert_ProtectedData_CannotMove"="Cannot move. There are one or more entries that are being protected at or around the specified position.";
"StrAlert_PhoneBook_ReWrite"="One or more entries have been changed by another user.\nDo you want to overwrite?";
"StrAlert_ProtectedData_WriteExcept"="The following entries become protected because another user has started to use them.\nEntry Number: %@\n\nDo you want to write the entries except above?";
"StrAlert_InUseByAnotherFunction_ClearData"="The entries displayed with a message \"In use by another function\" cannot be saved.\nDo you want to continue?";
"StrAlert_ProtectedData_CannotSaveStatus"="Protected condition of some entries will not be saved.\nDo you want to continue?";
"StrAlert_RestoreData_ClearNameUnknownCharacter"="The Name/Group Name field will become blank if there is any unsupported characters in the field of the restored data.";
"StrAlert_InUseByAnotherFunction_RestoreData"="One or more entries are in use by another function. They will be also overwritten with the restored ones.\nDo you want to continue?";

"StrAlert_ProtectedData_1"="Cannot save the following entries to your printer. They have been used and protected after you got them from the printer. When saving, the entries will be overwritten with these in the printer, and any changes you made to them will be lost.\nEntry Number: %@";
"StrAlert_ProtectedData_2"="The following Group Dial entries include one or more Speed Dial entries that are currently protected in the printer. These Speed Dials will be excluded when saving a group. Group Dials will be deleted when no Speed Dial in a group.\nEntry Number: %@";
"StrAlert_ProtectedData_3"="Do you want to continue?";
"StrAlert_RestoreData_1"="Cannot restore the following Speed Dial or Group Dial entries in the backup file.\nEntry Number: %@\nProtected entries with the numbers above cannot be overwritten.";
"StrAlert_RestoreData_2"="The following Group Dial entries include one or more Speed Dial entries which cannot be restored. Any unrestorable Speed Dials will be excluded when restoring a group. Group Dials will be deleted when no Speed Dial in a group.\nEntry Number: %@";
"StrAlert_RestoreData_3"="Do you want to continue?";
"StrAlert_Confirm_Delete_ALLData_ExceptProtect"="There are one or more protected Speed Dial or Group Dial entries. Any protected entries cannot be deleted. Do you want to delete all the entries except the one with protection?";

"Str_FaxContacts"="Contacts";
"Str_FaxAddressBook"="Address Book";
"StrAlert_CannotAccessContacts_A"="Access to %@ is not allowed.";
"StrAlert_CannotAccessContacts_B"="Allow FAX Utility to access %@. Go to [System Preferences] - [Security & Privacy] - [Privacy] - [%@].\nRestart FAX Utility to update. ";
